import Head from "next/head"

export default function Privacy() {
    return (
        <div>
            <Head>
                <title>ioCloud Privacy Policy</title>
                <meta name="description" content="Cloud I/O streaming platform" />
                <link rel="icon" href="/iocloud-logo.svg" />
                <link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
                <link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
                <link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
                <link rel="manifest" href="/site.webmanifest" />
                <link rel="mask-icon" href="/safari-pinned-tab.svg" color="#5bbad5" />
                <meta name="theme-color" content="#ff0000" />
            </Head>

            <div className="min-h-screen bg-gray-50 py-8 flex flex-col justify-center relative overflow-hidden lg:py-12">
                <div dir='rtl' className="fontFa mt-8 prose prose-slate mx-auto lg:prose-lg">
                    <h1>سیاست حریم خصوصی ioCloud</h1>
                    <p>مهم‌ترین سرمایه‌ی ما کاربران و مشتریانی هستند که به این پلتفرم اعتماد کرده‌اند و از محصولات آن استفاده می‌کنند. ما به‌خوبی آگاهیم که حفظ حریم خصوصی شما تا چه میزان برای‌تان اهمیت دارد، از این رو سند «سیاست حفظ حریم خصوصی ioCloud» را در اختیارتان قرار می‌دهیم تا از جزییات آن آگاه شوید.</p>
                    <blockquote>
                        <p>با پذیرش سیاست حفظ حریم خصوصی ioCloud، مسوولیت انطباق این سند و سیاست‌های سرویس تان به‌عهده‌ی شماست</p>
                    </blockquote>
                    <h3>چه تعهداتی به شما داریم؟ </h3>
                    <p>اطلاعاتی که در اختیار ما قرار می‌دهید مانند نام و نام خانوادگی، اطلاعات تماس، اطلاعات بانکی و اطلاعات مربوط به دامنه به هیچ‌وجه به فروش نخواهد رسید و اجاره داده نخواهد شد. هم‌چنین این داده‌ها خارج از آن‌چه در آخرین نسخه‌ی این سند آمده ‌است با هیچ فرد یا نهادی افشا یا به اشتراک گذاشته نمی‌شود.</p>
                    <hr />
                    <h3>چه اطلاعاتی را جمع‌آوری می کنیم؟</h3>
                    <p>ما برای بهتر کردن سرویس ها و بالا بردن سطح رضایت مشتریان بخش هایی از اطلاعات را ذخیره می کنیم.</p>
                    <ol>
                        <li>اطلاعات حساب کاربری: هنگامی‌که برای ایجاد حساب کاربری ثبت‌نام می‌کنید، ioCloud اطلاعات تماس شما را گردآوری خواهد کرد. این اطلاعات شامل نام، نشانی ایمیل، کد ملی، شماره تلفن و نشانی‌های ضروری برای پردازش پرداخت و انتقال سرویس‌هاست. هنگامی‌که هرگونه اطلاعات شخصی یا حقوقی را به ما ارایه می‌دهید، به این معنی است که صاحب آن اطلاعات هستید یا اجازه‌ی لازم برای ارایه‌ی آن به ما را دارید.</li>
                        <li>داده‌های لاگ ‌شده: ioCloud اطلاعات کاربران نهایی را به نمایندگی از مشتریان خود پردازش می‌کند. این اطلاعات هنگامی پردازش می‌شوند که کاربران نهایی وارد سرویس های ما شده و از آن‌ها استفاده می‌کنند .اطلاعات پردازش شده ممکن است شامل نشانی‌های IP، اطلاعات پیکربندی سیستم و سایر اطلاعات ترافیک به/از سرویس های مشتریان، ابزارها، برنامه‌ها یا شبکه‌ها (در مجموع، داده‌های ثبت‌شده) شود، اما به آن‌ها محدود نخواهد شد.</li>
                    </ol>
                    <hr />
                </div>
            </div>
        </div>
    )
}
